# NonStringParameterValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PropertySetElementFailures..::..NonStringParameterValue Property
BuiltInFailures..::..PropertySetElementFailures Class See Also
---
The given parameter requires a string value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NonStringParameterValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NonStringParameterValue As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NonStringParameterValue {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PropertySetElementFailures Class
Autodesk.Revit.DB Namespace